'''Main – запуск гри та обробка подій'''
# 6. Імпортуємо все що необхідно для роботи гри


# 7. Ініцилізація та Створити вікно 


# 8. Створити список ректів - клавіш

# 9. Створити порожню множину - натиснуті клавіши

# 10. Створити список звуків - завантажити звуки нот


# 11. Головний цикл гри:

# - обробка закртиття вікна
   
#  - обробка подій (натискання та відпускання клавіш)
        
#  - обробка кліку по клавішам
   
#  - відобразити фон, клавіши, оновити вікно
    
    # обробка лкіку по клавішам


