'''налаштування гри (розмір вікна, кольори, список нот)'''

#1. Створити глобальні змінні налаштувань гри:
# - висота, шрина вікна = 500 на  400
# - кілкість клавіш = 7
#  - висота, ширина клавіш = 50 на 100
#  - коордиати початку першої клавіші (щоб клавіші були по центру вікна)
#  - кольори для фону, клавіш, ефектів
#  - словник, який зіставляє клавіші клавіатури (наприклад, "a", "s", "d", "f", "g", "h", "j") з відповідними звуковими файлами нот (наприклад, "c6.mp3", "d6.mp3" і т.д.)
WINDOWS_WIDTH = 500
WINDOWS_HIGHT = 400

KEY_WIDTH = 50  
KEY_HIGHT = 100

X_START = 45
Y_START = 200

BLACK = (0, 0, 0)
WHITE = (255, 255, 255)
RED = (255, 0, 0)
GREEN = (0, 255, 0)
BLUE = (0, 0, 255)
GREY = (120, 120, 120)
        
KEY = {
    "a": "c6.mp3",
    "b": "d6.mp3",
    "c": "e6.mp3",
    "d": "f6.mp3",
    "e": "g6.mp3",
    "f": "f6.mp3",
    "g": "g6.mp3",
}
