'''налаштування гри (розмір вікна, кольори, список нот)'''

#1. Створити глобальні змінні налаштувань гри: 
# - висота, шрина вікна = 500 на  400
WINDOW_WIDTH = 500
WINDOW_HEIGHT = 400
# - кілкість клавіш = 7
#  - висота, ширина клавіш = 50 на 100
KEY_WIDTH = 50
KEY_HEIGHT = 100
#  - коордиати початку першої клавіші (щоб клавіші були по центру вікна)
X_START = 45
Y_START = 200
#  - кольори для фону, клавіш, ефектів
BLACK = (0,0,0)
WHITE = (255,255,255)
BLUE = (0,0,200)
GRAY = (120,120,120)
#  - словник, який зіставляє клавіші клавіатури (наприклад, "a", "s", "d", "f", "g", "h", "j") з відповідними звуковими файлами нот (наприклад, "c6.mp3", "d6.mp3" і т.д.)
KEY = {
    "a": "a6.mp3",
    "b": "b6.mp3",
    "c": "c6.mp3",
    "d": "d6.mp3",
    "e": "e6.mp3",
    "f": "f6.mp3",
    "g": "g6.mp3"
}

