'''Клас меню налаштування - гучності та кількості клавіш'''
# імпортуй клас кнопки
# імпортуй клас повзунка
# імпортуй список клавіш
from buttons import Button
from ui.slider import Slider
from settings import KEY
# клас меню налаштувань. Аргументи:
# координати для кнокпи налаштування та розміри
# кольри: кнопки, тексту, слайдера
class SettingsMenu:                 
    def __init__(self,x,y,w,h,col_btn,col_txt,col_slider): 
        # створи кнопку відкриття меню налаштувань: 

        # координати, розмір, кольри - з конструктора класу, 
        # теккст -"Setting" , 
        # оманда - відкрити меню
        
        # створи кнопку повернення назад
        # координати, розмір, кольри - з конструктора класу, 
        # текст -"Back" , 
        # команда - закрити меню
     
        # змісти координати для розміщення елементів меню - тексти+слайдери, 
        # х = ч + половина висоти, у = у + ширина
    

        # створи текстову кнопку (підпис) для гучності: 
        # координати - що розрахували вище, 
        # текст = "Volume", команди = немає
        
        # обчисли позицію для повзунка (праворуч від тексту), 
        # х2 = права координата текстової кнокпи + половина висоти
        
        # трохи змісти вниз для кращого вирівнювання : у = у + чверть висоти

        # створи повзунок гучності : 
        # координати - ті що розрахували вище, 
        # ширина = три ширина, 
        # висота = половина висоти
        # (від 0 до 101)
       
        # створи змінну для збереження гучності = 0

        # змісти вниз для наступного блоку= у + дві вистоти
 
        # створи текст для кількості клавіш: 
        # координати - що розрахували вище, 
        # текст = "Num keys", команди = немає
 
        # трохи змісти вниз : у = у + чверть висоти
  
        # створи повзунок кількості клавіш
        # координати - ті що розрахували вище(х2, у), 
        # ширина = три ширина, 
        # висота = половина висоти
        # (від 0 до кількості клавіш KEYS+1)

        # створи змінну для збереження кількості клавіш = 0
  
        # задай початковий стан (гра)= властивість game_part = "game"
        

    def open_menu(self):
        # переключи стан на меню налаштувань
        
    def close_menu(self): 
        # поверни стан назад до гри
        

    # метод відображення кнопок  та сладйерів меню
    def darw(self, window):
        # якщо стан гри = гра
        
            # намалюй кнопку налаштувань
            
        # якщо стан гри = налащтування
        
            # намалюй кнопку назад
            
            # намалюй текст гучності
          
            # намалюй повзунок гучності

            # намалюй текст кількості клавіш

            # намалюй повзунок кількості клавіш

           
    #метод оновлення меню
    def update(self, event=None):
        # якщо стан гри = гра
          
            # перевір натискання кнопки налаштувань
            
        # якщо стан гри = налащтування
       
        
            # перевір натискання кнопки назад
           
            # оброби перетягування повзунка гучності
          
            # оброби перетягування повзунка клавіш

            # 0 - 1 (нормалізація гучності) : значення сладйера гучності  / 100  

            # збережи вибрану кількість клавіш