'''Клас меню налаштування - гучності та кількості клавіш'''
# імпортуй клас кнопки
# імпортуй клас повзунка
# імпортуй список клавіш
from buttons import Button
from ui.slider import Slider
from settings import KEYS,BLACK, GRAY, BLUE
# клас меню налаштувань. Аргументи:
# координати для кнокпи налаштування та розміри
# кольри: кнопки, тексту, слайдера
class SettingsMenu:                 
    def __init__(self,x,y,w,h,col_btn,col_txt,col_slider): 
        # створи кнопку відкриття меню налаштувань: 

        # координати, розмір, кольри - з конструктора класу, 
        # текст -"Setting" , 
        # команда - відкрити меню
        self.btn_open = Button(x,y,w,h,col_btn,"Settings",col_txt,command= self.open_menu,image="assets/images/buttons/settings_hover.png")
        # створи кнопку повернення назад
        # координати, розмір, кольри - з конструктора класу, 
        # текст -"Back" , 
        # команда - закрити меню
        self.btn_close = Button(x,y,w,h,col_btn,"Back",col_txt,command= self.close_menu,image="assets/images/buttons/exit_hover.png")
        # змісти координати для розміщення елементів меню - тексти+слайдери, 
        # х = ч + половина висоти, у = у + ширина
 

        # створи текстову кнопку (підпис) для гучності: 
        # координати - що розрахували вище, 
        # текст = "Volume", команди = немає
        
        # обчисли позицію для повзунка (праворуч від тексту), 
        # х2 = права координата текстової кнокпи + половина висоти
     
        
        # трохи змісти вниз для кращого вирівнювання : у = у + чверть висоти
     

        # створи повзунок гучності : 
        # координати - ті що розрахували вище, 
        # ширина = три ширина, 
        # висота = половина висоти
        # (від 0 до 101)
        
        # створи змінну для збереження гучності = 0
        

        # змісти вниз для наступного блоку= у + дві вистоти
       
 
        # створи текст для кількості клавіш: 
        # координати - що розрахували вище, 
        # текст = "Num keys", команди = немає
        
 
        # трохи змісти вниз : у = у + чверть висоти
  
        # створи повзунок кількості клавіш
        # координати - ті що розрахували вище(х2, у), 
        # ширина = три ширина, 
        # висота = половина висоти
        # (від 0 до кількості клавіш KEYS+1)

        # створи змінну для збереження кількості клавіш = 0
       
        # задай початковий стан (гра)= властивість game_part = "game"
        self.game_part = "game"

    
    def open_menu(self):
        # переключи стан на меню налаштувань
        self.game_part = "settings"
    def close_menu(self): 
        # поверни стан назад до гри
        self.game_part = "game"

    # метод відображення кнопок  та сладйерів меню
    def darw(self, window):
        # якщо стан гри = гра
        if self.game_part == "game":
            # намалюй кнопку налаштувань
            self.btn_open.draw(window)
        # якщо стан гри = налащтування
        if self.game_part == "settings":
            # намалюй кнопку назад
            self.btn_close.draw(window)
            # намалюй текст гучності
           
          
            # намалюй повзунок гучності
            
            # намалюй текст кількості клавіш
           

            # намалюй повзунок кількості клавіш
           
           
    #метод оновлення меню
    def update(self, event=None):
        # якщо стан гри = гра
         if self.game_part == "game" :   
            # перевір натискання кнопки налаштувань
            self.btn_open.is_clicked()
        # якщо стан гри = налащтування
         if self.game_part == "settings":
        
            # перевір натискання кнопки назад
            self.btn_close.is_clicked()
            
            # оброби перетягування повзунка гучності
            
          
            # оброби перетягування повзунка клавіш
           

            # 0 - 1 (нормалізація гучності) : значення сладйера гучності  / 100 
            #  

            # збережи вибрану кількість клавіш