'''Напиши клас для слайдера'''

# підключи бібліотеку pygame для роботи з графікою
# імпортуй чорний колір з файлу налаштувань

# клас повзунка (Slider)
#аргументи - координати, розмір, мак.число повзунка, колір повзунка, колір поінтера
class Slider:                        
    def __init__():
        # зберіхи у властивість максимальне значення повзунка
  
        # створи прямокутник основи повзунка - координати та розмір із конструктора
        
        # створи повзунок (кнопкуб поінтер): 
        # х такий самийб у - половина висоти слайдера 
        # вистоа, ширина(квадрат) - висота слайдера*2
   
        # встанови початкову позицію центра повзунка по X 

        # задай колір основи

        # задай колір повзунка

        # встанови початкове значення (0) сладйера

        # створи прапорець перетягування (спочатку False)

        # створи змінну для зсуву миші

        # запам’ятай початок повзунка х

        # запам’ятай кінець повзунка: х + ширина слайдера

        # створи шрифт для відображення значення розмір шрифта=вистоа слайдера

        # одразу виклич метод для оновлення даних тексту сладйера, його значення
         

    def draw(self, screen):
        # намалюй основу повзунка

        # додай рамку


        # намалюй сам повзунок

        # додай рамку повзунка

        
        # обчисли позицію тексту по X : 
        #х.поінтера + ширина повзунка // 2.6

        # обчисли позицію тексту по Y : 
        #у.поінтера + ширина повзунка // 3

        # виведи текст значення на екран
    
    def update(self, event):
        # перевіремо подію мишка натиснута та якщо вже не натиснута
        
            # отримай позицію кліку миші
            # перевір чи натиснули саме на повзунок
                # увімкни режим перетягування
                
                # обчисли зсув курсора: х.поінтер - х.миші

        # перевіремо подію мишка  не натиснута
        
            # вимкни режим перетягування
            
        # перевіремо подію мишка рухається
        
            # обчисли нову позицію по X: 
            # зсув миші + х.миші
            # перевір межі руху та якщо режим перетягуванн:
            #нова позиція миші більша за початкову та менша за кінцеву
                # перемісти повзунок: ценрт_х = новий х
                # онови значення  = викликати метод

    def update_value(self):
        # знайди значення повзунка:
        #координати х поінтера повзунка - стартове значення(стартова координата)

        # переведи  у значення: 
        # знайдене значення ділимо на ширину слайдера та множимо на максимальне значення слайдера
        #округлити значення
        
        # створити текст значення